In [13]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:root@localhost:5432/uber')
engine.connect()

In [14]:
%load_ext sql
%sql postgresql://postgres:root@localhost:5432/uber

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
%%sql
SELECT * FROM main LIMIT 10;

 * postgresql://postgres:***@localhost:5432/uber
10 rows affected.

[(8489652, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 7, 14, 17, 22, 45), datetime.datetime(2019, 7, 14, 17, 25, 40), datetime.datetime(2019, 7, 14, 17, 26, 50), datetime.datetime(2019, 7, 14, 17, 34, 23), 64, 175, 2.04, 453, 4.57, 0.0, 0.0, 0.4, 0.0, None, 0.0, 5.97, 'Y', 'N', ' ', 'N', ' '),
 (10224090, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 7, 17, 15, 6, 7), datetime.datetime(2019, 7, 17, 15, 7, 5), datetime.datetime(2019, 7, 17, 15, 9, 2), datetime.datetime(2019, 7, 17, 15, 46, 16), 108, 216, 14.11, 2235, 44.67, 0.0, 0.0, 3.87, 0.0, None, 0.0, 33.89, 'N', 'N', ' ', 'N', ' '),
 (1454758, 'HV0002', 'B03035', 'B03035', datetime.datetime(2019, 7, 3, 15, 52, 8), datetime.datetime(1970, 1, 1, 0, 0), datetime.datetime(2019, 7, 3, 15, 58, 6), datetime.datetime(2019, 7, 3, 16, 13, 5), 25, 61, 2.34, 898, 13.54, 0.0, 0.33, 1.2, 0.0, None, 3.35, 10.54, 'N', 'N', 'N', 'N', 'N'),
 (18147309, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 7, 28, 16, 25, 47), datetime.datetime(2019, 7, 28, 16, 32, 52), datetime.datetime(2019, 7, 28, 16, 34, 43), datetime.datetime(2019, 7, 28, 16, 55, 1), 76, 219, 6.78, 1218, 22.82, 0.0, 0.0, 1.98, 0.0, None, 0.0, 9.49, 'Y', 'Y', ' ', 'N', 'N'),
 (18806014, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 7, 29, 17, 21, 39), datetime.datetime(2019, 7, 29, 17, 31, 25), datetime.datetime(2019, 7, 29, 17, 32, 44), datetime.datetime(2019, 7, 29, 18, 10, 52), 248, 113, 11.78, 2287, 16.62, 6.12, 0.0, 1.99, 0.75, None, 0.0, 34.38, 'Y', 'Y', ' ', 'N', 'N'),
 (3019595, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 7, 6, 9, 5, 3), datetime.datetime(2019, 7, 6, 9, 5, 15), datetime.datetime(2019, 7, 6, 9, 7, 48), datetime.datetime(2019, 7, 6, 9, 36, 2), 17, 265, 8.35, 1588, 45.23, 20.0, 0.0, 0.0, 0.0, None, 9.6, 56.47, 'N', 'N', ' ', 'N', ' '),
 (9923739, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 7, 17, 4, 42, 8), datetime.datetime(2019, 7, 17, 4, 46, 12), datetime.datetime(2019, 7, 17, 4, 47, 38), datetime.datetime(2019, 7, 17, 4, 59, 31), 219, 132, 4.79, 713, 14.14, 0.0, 0.0, 1.22, 0.0, None, 0.0, 11.12, 'N', 'N', ' ', 'N', ' '),
 (2265580, 'HV0003', 'B02836', 'B02836', datetime.datetime(2019, 7, 4, 23, 46), datetime.datetime(2019, 7, 4, 23, 47, 24), datetime.datetime(2019, 7, 4, 23, 48, 35), datetime.datetime(2019, 7, 4, 23, 56, 26), 248, 242, 1.43, 471, 6.94, 0.0, 0.0, 0.6, 0.0, None, 0.0, 5.45, 'N', 'N', ' ', 'N', ' '),
 (6861760, 'HV0003', 'B02882', 'B02882', datetime.datetime(2019, 7, 12, 16, 23, 9), datetime.datetime(2019, 7, 12, 16, 23, 24), datetime.datetime(2019, 7, 12, 16, 24, 18), datetime.datetime(2019, 7, 12, 17, 20, 14), 186, 45, 2.71, 3355, 24.95, 0.0, 0.0, 2.16, 2.75, None, 5.97, 36.62, 'N', 'N', ' ', 'N', ' '),
 (10251418, 'HV0003', 'B02765', 'B02765', datetime.datetime(2019, 7, 17, 16, 1, 46), datetime.datetime(2019, 7, 17, 16, 2, 5), datetime.datetime(2019, 7, 17, 16, 3, 55), datetime.datetime(2019, 7, 17, 16, 14, 39), 171, 92, 2.16, 645, 9.12, 0.0, 0.0, 0.79, 0.0, None, 0.0, 7.69, 'N', 'N', ' ', 'N', ' ')]

In [16]:
%%sql
SELECT * FROM zones LIMIT 10;

 * postgresql://postgres:***@localhost:5432/uber
10 rows affected.

[(0, 1, 'EWR', 'Newark Airport', 'EWR'),
 (1, 2, 'Queens', 'Jamaica Bay', 'Boro Zone'),
 (2, 3, 'Bronx', 'Allerton/Pelham Gardens', 'Boro Zone'),
 (3, 4, 'Manhattan', 'Alphabet City', 'Yellow Zone'),
 (4, 5, 'Staten Island', 'Arden Heights', 'Boro Zone'),
 (5, 6, 'Staten Island', 'Arrochar/Fort Wadsworth', 'Boro Zone'),
 (6, 7, 'Queens', 'Astoria', 'Boro Zone'),
 (7, 8, 'Queens', 'Astoria Park', 'Boro Zone'),
 (8, 9, 'Queens', 'Auburndale', 'Boro Zone'),
 (9, 10, 'Queens', 'Baisley Park', 'Boro Zone')]

In [20]:
%%sql
SELECT
MIN(request_datetime) min_request, 
MAX(request_datetime) max_request
FROM main;

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(datetime.datetime(2019, 6, 30, 23, 58, 7), datetime.datetime(2019, 7, 31, 23, 56, 10))]

In [21]:
%%sql
SELECT
MIN(pickup_datetime) min_pickup, 
MAX(pickup_datetime) max_pickup
FROM main;

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(datetime.datetime(2019, 7, 1, 0, 5, 47), datetime.datetime(2019, 7, 31, 23, 59, 33))]

### Fares

In [22]:
%%sql
-- Min/max for fare
-- we can see that a negative base fare exists
SELECT
MIN(base_passenger_fare) min_fare, 
MAX(base_passenger_fare) max_fare
FROM main;

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(-30.98, 287.27)]

In [32]:
%%sql
-- Less than 1% of rides have a negative base fare
SELECT 
ROUND(100 * SUM((base_passenger_fare < 0)::int)::numeric
/ (SELECT COUNT(*) FROM main), 2) "Percent Negative Fares"
FROM main
LIMIT 10

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('0.37'),)]

### Trip Miles

In [33]:
%%sql
-- Min/max for miles
-- We can see a 'zero miles' trip exists
SELECT
MIN(trip_miles) min_miles, 
MAX(trip_miles) max_miles
FROM main;

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(0.0, 130.86)]

### Trip Time

In [40]:
%%sql
-- Are these trips an anomaly?
-- The base fare is positive which suggests these are brief but real rides
SELECT
trip_miles,
base_passenger_fare,
trip_time/60 "Trip time (minutes)"
FROM main
WHERE trip_miles = (SELECT MIN(trip_miles) FROM main)
;

 * postgresql://postgres:***@localhost:5432/uber
2 rows affected.

[(0.0, 3.66, 5), (0.0, 5.52, 9)]

In [38]:
%%sql
SELECT 
min(trip_time) / 60 "Min Trip Time (Minutes)",
max(trip_time) / 60 "Max Trip Time (Minutes)"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(0, 218)]

### Driver Pay

In [52]:
%%sql
SELECT 
MIN(driver_pay) min_pay, 
MAX(driver_pay) max_pay
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(0.0, 289.04)]

In [57]:
%%sql
-- Percent with no pay
SELECT 
ROUND(
100 * AVG((driver_pay = 
(SELECT MIN(driver_pay) FROM main)
)::int)
, 2) "Percent No Driver Pay"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('13.06'),)]

### Sharing Rides

In [58]:
%%sql
-- distinct values
SELECT DISTINCT shared_request_flag
FROM main

 * postgresql://postgres:***@localhost:5432/uber
2 rows affected.

[('Y',), ('N',)]

In [47]:
%%sql
-- Percent that requested share
SELECT 
100 * ROUND(
AVG((shared_request_flag = 'Y')::int)
, 2) "Percent Requested Share"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('21.00'),)]

In [48]:
%%sql
-- but only about 14% actually receive a share
SELECT 
100 * ROUND(
AVG((shared_request_flag = 'Y')::int)
, 2) "Percent Requested Share",
100 * ROUND(
AVG((shared_match_flag = 'Y')::int)
, 2) "Percent Successful Share"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('21.00'), Decimal('14.00'))]

In [69]:
%%sql
/*
finding: shared rides are less likely to tip
However, could be due to a different average trip time
*/
SELECT 
shared_request_flag, 
ROUND(
    100*AVG((tips > 0)::int)
    , 2) "Percent with Tips",
ROUND(
    AVG(trip_miles)
    , 2) avg_trip
FROM main 
GROUP BY shared_request_flag
ORDER BY AVG((tips>0)::int) DESC

 * postgresql://postgres:***@localhost:5432/uber
2 rows affected.

[('N', Decimal('15.39'), 4.928733875063473),
 ('Y', Decimal('7.06'), 4.234206685499059)]

### Wheelchair Rides

In [68]:
%%sql
-- Percent that requested wheelchair
-- very low
SELECT 
100 * ROUND(
AVG((wav_request_flag = 'Y')::int)
, 2) "Percent Requested Wheelchair"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('0.00'),)]

### Tips

In [62]:
%%sql
SELECT 
MIN(tips) min_tips,
MAX(tips) max_tips
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(0.0, 41.93)]

In [51]:
%%sql
SELECT 
ROUND(
    100*AVG((tips > 0)::int)
    , 2) "Percent with Tips"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('13.62'),)]

### Tolls

In [63]:
%%sql
SELECT 
ROUND(
    100*AVG((tolls > 0)::int)
    , 2) "Percent with Tolls"
FROM main

 * postgresql://postgres:***@localhost:5432/uber
1 rows affected.

[(Decimal('10.39'),)]